Repository: BravoBaldo/Translations
Catalog: GoogleTest/GoogleTest_OmegaT/omegat/project_save.tmx
Source language: en_us
Languages: it_it

source: The following assertions test for `HRESULT` success or failure.
it_it: Le seguenti asserzioni verificano il successo o il fallimento di `HRESULT`.

source: The following assertions verify that a piece of code causes the process to terminate.
it_it: Le seguenti asserzioni verificano che un pezzo di codice causi la terminazione del processo.

source: The following assertions verify that a piece of code throws, or does not throw, an exception.
it_it: Le seguenti asserzioni verificano che una parte di codice lanci o non lanci un'eccezione.

source: The following chainable clauses can be used to modify the expectation, and they must be used in the following order:
it_it: Le seguenti clausole concatenabili possono essere utilizzate per modificare la expectation e devono essere utilizzate nel seguente ordine:

source: The following chainable clauses can be used to set the method's behavior, and they must be used in the following order:
it_it: Le seguenti clausole concatenabili possono essere utilizzate per impostare il comportamento del metodo e devono essere utilizzate nel seguente ordine:

source: The following code can turn ASSERT-failure into an exception:
it_it: Il seguente codice può trasformare ASSERT-failure in un'eccezione:

source: The following is a list, in no particular order, of links to documentation created by the Googletest community.
it_it: Di seguito è riportato un elenco, senza un ordine particolare, dei link alla documentazione creata dalla community di Googletest.

source: The following matchers can be used to match a tuple (x, y):
it_it: I seguenti matcher possono essere utilizzati per corrispondere a una tupla (x, y):

source: The following matchers can be used to match a tuple `(x, y)`:
it_it: I seguenti matcher possono essere utilizzati per corrispondere a una tupla `(x, y)`:

source: The following may not do what you want:
it_it: Quanto segue potrebbe non fare quello che si desidera:

source: The following statement will instantiate all tests from FooTest again, each with parameter values "cat" and "dog" using the ValuesIn parameter generator:
it_it: La seguente istruzione istanzia nuovamente tutti i test da FooTest, ciascuno con i valori dei parametri "cat" e "dog" utilizzando il generatore di parametri ValuesIn:

source: The following statement will instantiate all tests from `FooTest` again, each with parameter values `"cat"` and `"dog"` using the [`ValuesIn`](reference/testing.md#param-generators) parameter generator:
it_it: La seguente istruzione istanzia nuovamente tutti i test da `FooTest`, ciascuno con i valori dei parametri `"cat"` e `"dog"` utilizzando il generatore di parametri [`ValuesIn`](reference/testing.md#param-generators):

source: The format for the test string is a series of wildcard patterns separated by colons (:).
it_it: Il formato della stringa di test è una serie di caratteri jolly separati da due punti (:).

source: The format of a filter is a ':'-separated list of wildcard patterns (called the positive patterns) optionally followed by a '-' and another ':'-separated pattern list (called the negative patterns).
it_it: Il formato di un filtro è un elenco di pattern di carattery jolly, separato da ':' (detti pattern positivi) seguito facoltativamente da un '-' e un altro elenco di pattern separato da ':' (detti pattern negativi).

source: The format of a filter is a '`:`'-separated list of wildcard patterns (called the *positive patterns*) optionally followed by a '`-`' and another '`:`'-separated pattern list (called the *negative patterns*).
it_it: Il formato di un filtro è un elenco di pattern di carattery jolly, separati da '`:`' (detti *pattern positivi*) seguito facoltativamente da un '`-`' e un altro elenco di pattern separati da '`:`' (detti *pattern negativi*).

source: The former expects the condition to always be true while the latter expects the two values to be mismatched.
it_it: La prima si aspetta che la condizione sia sempre vera mentre la seconda si aspetta che i due valori non corrispondano.

source: The former is usually preferred, as it has the following benefits:
it_it: Il primo è solitamente preferito perché presenta i seguenti vantaggi:

source: The framework will infer the fixture class from the factory and will call the SetUpTestSuite and TearDownTestSuite for it.
it_it: Il framework dedurrà la classe della fixture dalla factory e per questo chiamerà SetUpTestSuite e TearDownTestSuite.

source: The framework will infer the fixture class from the factory and will call the SetUpTestSuite and TearDownTestSuite methods for it.
it_it: Il framework dedurrà la classe fixture dalla factory e vi chiamerà i metodi SetUpTestSuite e TearDownTestSuite.

source: The framework will infer the fixture class from the factory and will call the `SetUpTestSuite` and `TearDownTestSuite` for it.
it_it: Il framework dedurrà la classe della fixture dalla factory e per questo chiamerà `SetUpTestSuite` e `TearDownTestSuite`.

source: The framework will infer the fixture class from the factory and will call the `SetUpTestSuite` and `TearDownTestSuite` methods for it.
it_it: Il framework dedurrà la classe fixture dalla factory e vi chiamerà i metodi `SetUpTestSuite` e `TearDownTestSuite`.

source: The function must accept an argument of type TestParamInfo<class ParamType> and return a std::string.
it_it: La funzione deve accettare un argomento di tipo TestParamInfo<class ParamType> e restituire una std::string.

source: The function call is expected at least *n* times.
it_it: La chiamata alla funzione è prevista almeno per *n* volte.

source: The function call is expected at least n times.
it_it: La chiamata alla funzione è prevista almeno per n volte.

source: The function call is expected at most *n* times.
it_it: La chiamata alla funzione è prevista al massimo per *n* volte.

source: The function call is expected at most n times.
it_it: La chiamata alla funzione è prevista al massimo per n volte.

source: The function call is expected between *m* and *n* times, inclusive.
it_it: La chiamata alla funzione è prevista tra *m* e *n* volte, estremi inclusi.

source: The function call is expected between m and n times, inclusive.
it_it: La chiamata alla funzione è prevista tra m e n volte, estremi inclusi.

source: The function call is expected exactly *n* times.
it_it: La chiamata alla funzione è prevista esattamente *n* volte.

source: The function call is expected exactly n times.
it_it: La chiamata alla funzione è prevista esattamente n volte.

source: The function can be called any number of times.
it_it: La funzione può essere chiamata un numero qualsiasi di volte.

source: The function does nothing if the assertion is satisfied.
it_it: La funzione non fa nulla se l'asserzione è soddisfatta.

source: The function must accept an argument of type [`TestParamInfo<class ParamType>`](#TestParamInfo) and return a `std::string`.
it_it: La funzione deve accettare un argomento di tipo [`TestParamInfo<class ParamType>`](#TestParamInfo) e restituire una `std::string`.

source: The function or functor you call using Invoke() must have the same number of arguments as the mock function you use it for.
it_it: La funzione o il funtore che si chiama utilizzando Invoke() deve avere lo stesso numero di argomenti della funzione mock per cui la si usa.

source: The function or functor you call using `Invoke()` must have the same number of arguments as the mock function you use it for.
it_it: La funzione o il funtore che si chiama utilizzando `Invoke()` deve avere lo stesso numero di argomenti della funzione mock per cui la si usa.

source: The function should accept one argument of type testing::TestParamInfo<class ParamType>, and return std::string.
it_it: La funzione deve accettare un argomento di tipo testing::TestParamInfo<class ParamType> e restituire std::string.

source: The function should accept one argument of type `testing::TestParamInfo<class ParamType>`, and return `std::string`.
it_it: La funzione deve accettare un argomento di tipo `testing::TestParamInfo<class ParamType>` e restituire `std::string`.

source: The general structure is MOCK_METHODn(MethodName, ReturnType(Args)), instead of MOCK_METHOD(ReturnType, MethodName, (Args)).
it_it: La struttura generale è MOCK_METHODn(MethodName, ReturnType(Args)), anziché MOCK_METHOD(ReturnType, MethodName, (Args)).

source: The general structure is `MOCK_METHODn(MethodName, ReturnType(Args))`, instead of `MOCK_METHOD(ReturnType, MethodName, (Args))`.
it_it: La struttura generale è `MOCK_METHODn(MethodName, ReturnType(Args))`, anziché `MOCK_METHOD(ReturnType, MethodName, (Args))`.

source: The general syntax is:
it_it: La sintassi generale è:

source: The general technique discussed here works for overloaded methods, but you'll need to tell the compiler which version you mean.
it_it: La tecnica generale discussa qui funziona per i metodi [overloaded], ma si dovrà dire al compilatore quale versione si intende.

source: The generated output contains the human-readable error message associated with the returned HRESULT code.
it_it: L'output generato contiene il messaggio di errore leggibile associato al codice HRESULT restituito.

source: The generated output contains the human-readable error message associated with the returned `HRESULT` code.
it_it: L'output generato contiene il messaggio di errore leggibile associato al codice `HRESULT` restituito.

source: The good news is that you can use a simple pattern to achieve the same effect.
it_it: La buona notizia è che si può usare un semplice pattern per ottenere lo stesso effetto.

source: The implementation is thread-safe on systems where the pthreads library is available.
it_it: L'implementazione è thread-safe sui sistemi in cui è disponibile la libreria pthreads.

source: The implementation is thread-safe on systems where the `pthreads` library is available.
it_it: L'implementazione è thread-safe sui sistemi in cui è disponibile la libreria `pthreads`.

source: The implementation of EXPECT_EQ(a, b) uses sizeof(... a ...) inside a template argument, and thus doesn't compile in opt mode when a contains a call to htonl().
it_it: L'implementazione di EXPECT_EQ(a, b) usa sizeof(... a ...) all'interno di un argomento template e quindi non viene compilato in modalità opt quando a contiene una chiamata a htonl().

source: The implementation of `EXPECT_EQ(a, b)` uses `sizeof(... a ...)` inside a template argument, and thus doesn't compile in opt mode when `a` contains a call to `htonl()`.
it_it: L'implementazione di `EXPECT_EQ(a, b)` usa `sizeof(... a ...)` all'interno di un argomento template e quindi non viene compilato in modalità opt quando `a` contiene una chiamata a `htonl()`.

source: The implication however is that the value must have a copy constructor and assignment operator.
it_it: L'implicazione tuttavia è che il valore deve avere un costruttore di copia e un operatore di assegnazione.

source: The inner action used in WithArgs and friends does not have to be Invoke() -- it can be anything.
it_it: L'azione interna utilizzata in WithArgs e simili non deve essere necessariamente Invoke(): può essere qualsiasi cosa.

source: The inner action used in `WithArgs` and friends does not have to be `Invoke()` -- it can be anything.
it_it: L'azione interna utilizzata in `WithArgs` e simili non deve essere necessariamente `Invoke()`: può essere qualsiasi cosa.

source: The interface for tracing execution of tests.
it_it: L'interfaccia per tracciare [tracing] l'esecuzione dei test.

source: The interface looks like this:
it_it: L'interfaccia è simile alla seguente:

source: The job is usually tedious and error-prone.
it_it: Il lavoro è solitamente noioso e soggetto a errori.

source: The key must be a valid XML attribute name, and cannot conflict with the ones already used by GoogleTest (name, file, line, status, time, classname, type_param, and value_param).
it_it: La chiave deve essere un nome di attributo XML valido e non può entrare in conflitto con quelli già utilizzati da GoogleTest (name, file, line, status, time, classname, type_param e value_param).

source: The key must be a valid XML attribute name, and cannot conflict with the ones already used by GoogleTest (`name`, `file`, `line`, `status`, `time`, `classname`, `type_param`, and `value_param`).
it_it: La chiave deve essere un nome di attributo XML valido e non può entrare in conflitto con quelli già utilizzati da GoogleTest (`name`, `file`, `line`, `status`, `time`, `classname`, `type_param`, and `value_param`).

source: The key to using a mock object successfully is to set the *right expectations* on it.
it_it: La chiave per utilizzare con successo un oggetto mock è quella di impostarvi le *expectation giuste*.

source: The key to using a mock object successfully is to set the right expectations on it.
it_it: La chiave per utilizzare con successo un oggetto mock è quella di impostarvi le expectation giuste.

source: The knowledge you gained from using one mock doesn't transfer to the next one.
it_it: La conoscenza acquisita utilizzando un mock non viene trasferita a quello successivo.

source: The last two lines enable CMake's test runner to discover the tests included in the binary, using the [`GoogleTest` CMake module](https://cmake.org/cmake/help/git-stage/module/GoogleTest.html).
it_it: Le ultime due righe consentono al runner dei test di CMake di scoprire i test inclusi nel file binario, utilizzando il [modulo `GoogleTest` di CMake](https://cmake.org/cmake/help/git-stage/module/GoogleTest.html).

source: The latter ability is used for generating readable error messages when expectations are violated.
it_it: Quest'ultima capacità viene utilizzata per generare messaggi di errore leggibili quando le expectation vengono violate.

source: The latter provides an empty implementation of all methods in the interface, such that a subclass only needs to override the methods it cares about.
it_it: L'ultimo fornisce un'implementazione vuota di tutti i metodi nell'interfaccia, in modo tale che una sottoclasse debba solo sovrascrivere i metodi che le interessano.

source: The macro gets 3 or 4 parameters:
it_it: La macro prende 3 o 4 parametri:

source: The macro has two arguments: first the mock object, and then the method and its arguments.
it_it: La macro ha due argomenti: prima l'oggetto mock, poi il metodo e i suoi argomenti.

source: The macros are: GTEST_USES_SIMPLE_RE=1 or GTEST_USES_POSIX_RE=1.
it_it: Le macro sono: GTEST_USES_SIMPLE_RE=1 o GTEST_USES_POSIX_RE=1.

source: The macros are: `GTEST_USES_SIMPLE_RE=1` or `GTEST_USES_POSIX_RE=1`.
it_it: Le macro sono: `GTEST_USES_SIMPLE_RE=1` o `GTEST_USES_POSIX_RE=1`.

source: The macros in the MOCK_METHODn family differ from MOCK_METHOD:
it_it: Le macro nella famiglia MOCK_METHODn differiscono da MOCK_METHOD:

source: The macros in the `MOCK_METHODn` family differ from `MOCK_METHOD`:
it_it: Le macro nella famiglia `MOCK_METHODn` differiscono da `MOCK_METHOD`:

source: The macros should be preferred when possible, as they avoid most of the complexity of calling this function.
it_it: Le macro dovrebbero essere preferite quando possibile, poiché evitano gran parte della complessità di chiamare questa funzione.

source: The majority of the macros listed below come as a pair with an EXPECT_ variant and an ASSERT_ variant.
it_it: La maggior parte delle macro elencate di seguito vengono fornite in coppia con una variante EXPECT_ e una ASSERT_.

source: The majority of the macros listed below come as a pair with an `EXPECT_` variant and an `ASSERT_` variant.
it_it: La maggior parte delle macro elencate di seguito vengono fornite in coppia con una variante `EXPECT_` e una `ASSERT_`.

source: The matcher body must be *purely functional* (i.e. it cannot have any side effect, and the result must not depend on anything other than the value being matched and the matcher parameters).
it_it: Il corpo del matcher deve essere *puramente funzionale* (vale a dire non può avere alcun effetto collaterale e il risultato non deve dipendere da nient'altro oltre al valore da abbinare e ai parametri del matcher).

source: The matcher body must be purely functional (i.e. it cannot have any side effect, and the result must not depend on anything other than the value being matched and the matcher parameters).
it_it: Il corpo del matcher deve essere puramente funzionale (vale a dire non può avere alcun effetto collaterale e il risultato non deve dipendere da nient'altro oltre al valore da abbinare e ai parametri del matcher).

source: The messages are compounded if you have many threads with depth stacks.
it_it: I messaggi sono complessi se sono presenti molti thread con stack profondi.

source: The method property() must take no argument and be declared as const.
it_it: Il metodo property() non deve accettare argomenti ed essere dichiarato come const.

source: The method `property()` must take no argument and be declared as `const`.
it_it: Il metodo `property()` non deve accettare argomenti ed essere dichiarato come `const`.

source: The methods below are listed in the order the corresponding events are fired.
it_it: I metodi seguenti sono elencati nell'ordine in cui vengono attivati gli eventi corrispondenti.

source: The mock function call is expected to occur after all of the given expectations.
it_it: Ci si aspetta che la chiamata di funzione mock avvenga dopo tutte le expectation indicate.

source: The name of the InSequence object does not matter.
it_it: Il nome dell'oggetto InSequence non ha importanza.

source: The name of the `InSequence` object does not matter.
it_it: Il nome dell'oggetto `InSequence` non ha importanza.

source: The need for EXPECT_NE(NULL, ptr) wasn't nearly as strong.
it_it: La necessità di EXPECT_NE(NULL, ptr) non era così pressante.

source: The need for `EXPECT_NE(NULL, ptr)` wasn't nearly as strong.
it_it: La necessità di `EXPECT_NE(NULL, ptr)` non era così pressante.

source: The new NPTL thread library doesn't suffer from this problem, as it doesn't create a manager thread.
it_it: La nuova libreria di thread NPTL non soffre di questo problema, poiché non crea un thread di gestione.

source: The next argument is the name of the test pattern, and the last is the parameter generator.
it_it: L'argomento successivo è il nome del pattern di test e l'ultimo è il generatore di parametri [parameter generator].

source: The next argument is the name of the test pattern, and the last is the [parameter generator](reference/testing.md#param-generators).
it_it: L'argomento successivo è il nome del pattern di test e l'ultimo è il [generatore di parametri](reference/testing.md#param-generators) [parameter generator].

source: The number n must equal the number of arguments.
it_it: Il numero n deve essere uguale al numero di argomenti.

source: The number `n` must equal the number of arguments.
it_it: Il numero `n` deve essere uguale al numero di argomenti.

source: The older TestCase API is being slowly deprecated and refactored away.
it_it: La vecchia API TestCase viene lentamente deprecata e sottoposta a refactoring.

source: The one constraint is that assertions that generate a fatal failure (FAIL* and ASSERT_*) can only be used in void-returning functions.
it_it: L'unico vincolo è che le asserzioni che generano un errore irreversibile (FAIL* e ASSERT_*) sono utilizzabili solo nelle funzioni che restituiscono void.

source: The one constraint is that assertions that generate a fatal failure (`FAIL*` and `ASSERT_*`) can only be used in void-returning functions.
it_it: L'unico vincolo è che le asserzioni che generano un errore irreversibile (`FAIL*` e `ASSERT_*`) sono utilizzabili solo nelle funzioni che restituiscono void.

source: The only instance is created when UnitTest::GetInstance() is first called.
it_it: L'unica istanza viene creata quando UnitTest::GetInstance() viene chiamato per la prima volta.

source: The only instance is created when `UnitTest::GetInstance()` is first called.
it_it: L'unica istanza viene creata quando `UnitTest::GetInstance()` viene chiamato per la prima volta.

source: The only requirement is that the type of the function, etc must be *compatible* with the signature of the mock function, meaning that the latter's arguments (if it takes any) can be implicitly converted to the corresponding arguments of the former, and the former's return type can be implicitly converted to that of the latter.
it_it: L'unico requisito è che il tipo della funzione, ecc. deve essere *compatibile* con la firma della funzione mock, il che significa che gli argomenti di quest'ultima (se ne accetta qualcuno) possono essere convertiti implicitamente negli argomenti corrispondenti del primo e il tipo restituito del primo possono essere convertiti implicitamente in quello del secondo.

source: The only requirement is that the type of the function, etc must be compatible with the signature of the mock function, meaning that the latter's arguments (if it takes any) can be implicitly converted to the corresponding arguments of the former, and the former's return type can be implicitly converted to that of the latter.
it_it: L'unico requisito è che il tipo della funzione, ecc. deve essere compatibile con la firma della funzione mock, il che significa che gli argomenti di quest'ultima (se ne accetta qualcuno) possono essere convertiti implicitamente negli argomenti corrispondenti del primo e il tipo restituito del primo possono essere convertiti implicitamente in quello del secondo.

source: The optional fourth parameter specs... is a comma-separated list of qualifiers.
it_it: Il quarto parametro facoltativo specs... è un elenco di qualificatori separati da virgole.

source: The optional fourth parameter *`specs...`* is a comma-separated list of qualifiers.
it_it: Il quarto parametro facoltativo *`specs...`* è un elenco di qualificatori separati da virgole.

source: The optional last argument *`name_generator`* is a function or functor that generates custom test name suffixes based on the test parameters.
it_it: L'ultimo argomento facoltativo *`name_generator`* è una funzione o un funtore che genera suffissi personalizzati del nome del test in base ai parametri del test.

source: The optional last argument name_generator is a function or functor that generates custom test name suffixes based on the test parameters.
it_it: L'ultimo argomento facoltativo name_generator è una funzione o un funtore che genera suffissi personalizzati del nome del test in base ai parametri del test.

source: The optional last argument to INSTANTIATE_TEST_SUITE_P() allows the user to specify a function or functor that generates custom test name suffixes based on the test parameters.
it_it: L'ultimo argomento facoltativo di INSTANTIATE_TEST_SUITE_P() consente all'utente di specificare una funzione o un funtore che genera suffissi personalizzati del nome del test in base ai parametri.

source: The optional last argument to `INSTANTIATE_TEST_SUITE_P()` allows the user to specify a function or functor that generates custom test name suffixes based on the test parameters.
it_it: L'ultimo argomento facoltativo di `INSTANTIATE_TEST_SUITE_P()` consente all'utente di specificare una funzione o un funtore che genera suffissi personalizzati del nome del test in base ai parametri.

source: The order of elements *matters* for `ElementsAre*()`.
it_it: L'ordine degli elementi *è importante* per `ElementsAre*()`.

source: The order of elements matters for ElementsAre*().
it_it: L'ordine degli elementi è importante per ElementsAre*().
